In [69]:
import pandas as pd
import statsmodels.api as sm

In [70]:
import os

os.chdir('D:\Python Programming\Data')
os.getcwd()

'D:\\Python Programming\\Data'

In [80]:
dataset = pd.read_csv('D:\Python Programming\Data\car_data.csv')

In [81]:
dataset

     User ID  Gender  Age  AnnualSalary  Purchased
0        385    Male   35         20000          0
1        681    Male   40         43500          0
2        353    Male   49         74000          0
3        895    Male   40        107500          1
4        661    Male   25         79000          0
..       ...     ...  ...           ...        ...
995      863    Male   38         59000          0
996      800  Female   47         23500          0
997      407  Female   28        138500          1
998      299  Female   48        134000          1
999      687  Female   44         73500          0

[1000 rows x 5 columns]

In [82]:
dataset.columns

Index(['User ID', 'Gender', 'Age', 'AnnualSalary', 'Purchased'], dtype='object')

In [83]:
 dataset.head()

   User ID Gender  Age  AnnualSalary  Purchased
0      385   Male   35         20000          0
1      681   Male   40         43500          0
2      353   Male   49         74000          0
3      895   Male   40        107500          1
4      661   Male   25         79000          0

In [84]:
 Y = dataset.Purchased

In [93]:
X = dataset[['Age','AnnualSalary']]

In [94]:
X1 = sm.add_constant(X)

In [95]:
Logistic = sm.Logit(Y,X1)

In [96]:
result = Logistic.fit()

Optimization terminated successfully.
         Current function value: 0.372966
         Iterations 7

In [97]:
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:              Purchased   No. Observations:                 1000
Model:                          Logit   Df Residuals:                      997
Method:                           MLE   Df Model:                            2
Date:                Sat, 30 Jul 2022   Pseudo R-squ.:                  0.4465
Time:                        15:46:04   Log-Likelihood:                -372.97
converged:                       True   LL-Null:                       -673.81
Covariance Type:            nonrobust   LLR p-value:                2.205e-131
================================================================================
                   coef    std err          z      P>|z|      [0.025      0.975]
--------------------------------------------------------------------------------
const          -11.8442      0.769    -15.399      0.000     -13.352     -10.337
Age              0.2161      0.015     14.520      0.000       0.187       0.245
AnnualSalary  3.325e-05   3.21e-06     10.344      0.000     2.7e-05    3.96e-05
================================================================================
"""

In [98]:
#both annual salary and age hve a significant impact on purchases
#p(y\n) = 1/(1+e^(-2.15 + 3.325(Anuuual Salary) + 0.2161(Age)))